# Задача 2.
# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# number = int(input('Введите трёхзначное число: '))

list = int(input('Введите трёхзначное число: '))

print(list)